Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: To some who take a constructive view of logic and mathematics, this is a faithful rendering of what it means to be a proposition: a proposition p represents a sort of data type, namely, a specification of the type of data that constitutes a proof.
ko: 논리와 수학에 직관주의적 관점을 갖는 누군가에게 이것은 명제가 되는 것의 의미를 충실하게 표현합니다. 명제 p은 일종의 데이터 유형을 나타냅니다. 주로 증명을 만드는 데이터 유형의 명세입니다.

source: To start with, we can avoid writing the term Proof repeatedly by conflating Proof p with p itself.
ko: 그렇기 위해 우리는 Proof p를 p를 같이 쓰는 것으로 Proof에 대한 반복적인 사용을 피할 수 있습니다.

source: To start with, we can use anonymous "have" expressions to introduce an auxiliary goal without having to label it.
ko: 우선, 우리는 익명 "have" 표현식으로 보조 목표의 이름 없이 도입하는데 사용할 수 있습니다.

source: To start with, you will learn the logical system that Lean is based on, a version of dependent type theory that is powerful enough to prove almost any conventional mathematical theorem, and expressive enough to do it in a natural way.
ko: 먼저 여러분은 Lean이 기초하고 있는 논리 체계 즉 거의 모든 기존의 수학적 정리를 증명할 수 있을 만큼 강력하고 그것을 자연스럽게 할 수 있을 만큼 충분히 표현력이 뛰어난 의존유형론 버전을 배웁니다.

source: To that end, the string _root_ is an explicit description of the empty prefix.
ko: 이 끝에서 문자열 _root_이 빈 접두사를 나타냅니다.

source: To the kernel type checker, there is no difference between the two.
ko: 커널 유형 확인기에서 둘 사이의 차이는 없습니다.

source: To understand the difficulty, consider what it would take to define a function tail which takes a vector v : vector α (succ n) and deletes the first element.
ko: 어려움을 이해하려면 벡터 v : vector α (succ n)를 받고 첫 번째 원소를 삭제하는 함수 tail를 정의하는데 무엇이 필요한지 고려해보세요.

source: To use Lean effectively you will inevitably need to make use of definitions and theorems in the library.
ko: 린을 효과적으로 사용하기 위해서 여러분은 라이브러리의 정의와 정리의 사용이 불가피하게 될 것입니다.

source: To use all the hypotheses present in the local context when simplifying, we can use the wildcard symbol, *:
ko: 단순화할 때 지역 상황에 나타난 모든 가정을 사용하기 위해서 우리는 와일드카드 기호 *를 사용할 수 있습니다.

source: To use this principle, you have to open the classical namespace.
ko: 이 원리를 사용하기 위해서 여러분은 classical 이름공간을 열어야 합니다.

source: Too much information can be overwhelming, though, and Lean's defaults are generally sufficient for ordinary interactions.
ko: 너무 많은 정보에 압도할 수 있지만 린의 기본설정도 평범한 상호작용에 일반적으로 충분합니다.

source: True
ko: 참

source: Try also defining the function length : {α : Type u} → List α → Nat that returns the length of a list, and prove that it behaves as expected (for example, length (append as bs) = length as + length bs).
ko: 리스트의 길이를 반환하는 함수 length : {α : Type u} → List α → Nat도 정의해 보세요. 그리고 이것 예상대로 동작하는지 증명하세요. (예를 들어 length (append as bs) = length as + length bs)

source: Try defining other operations on the natural numbers, such as multiplication, the predecessor function (with pred 0 = 0), truncated subtraction (with n - m = 0 when m is greater than or equal to n), and exponentiation.
ko: 자연수에 대해 곱셈, 선행자 함수 (pred 0 = 0으로), 절단된 뺄셈( m 이 n)보다 크거나 같을 때 n - m = 0으로)와 거듭제곱 같은 다른 연산을 정의해보세요.

source: Try proving these (one direction of the second of these requires classical logic):
ko: 이것들을 증명해 보세요.(이들 두 번째 예제의 한쪽 방향은 고전논리가 필요합니다.)

source: Turning on implicit arguments shows that the elaborator has inferred the decidability of the proposition x < a ∨ x > b, simply by applying appropriate instances.
ko: 단순히 적절한 개체를 적용함으로써 암시적인 인수을 여는 것은 협력기가 명제 x < a ∨ x > b의 결정가능성을 추론함을 보일 수 있습니다.

source: Two expressions that are equivalent up to associativity and commutativity are then rewritten to the same canonical form.
ko: 그럼 결합성과 교환성에 한해 동등한 두 표현식은 같은 정식 형태로 다시쓰일 것입니다.

source: Two more examples of inductive types in the library are the following:
ko: 라이브러리에서 귀납형의 둘 이상의 예제가 다음에 있습니다.

source: Type classes
ko: 유형 클래스

source: Type classes are implemented using attributes in Lean.
ko: 유형 클래스는 린의 속성을 사용해 구현됩니다.

source: Type classes were introduced as a principled way of enabling ad-hoc polymorphism in functional programming languages.
ko: 유형 클래스는 함수형 프로그래밍 언어에서 특수 목적(ad-hoc)의 다형성을 활성화하는 원칙적인 방법으로 도입되었습니다.

source: Type inference is an important part of Lean:
ko: 유형 추론은 Lean의 중요한 기능입니다.

source: Types as objects
ko: 대상으로써 유형

source: Typically, the expression p will depend on x : α.
ko: 일반적으로 표현식 p는 x : α에 의존할 것입니다.

source: Under the hood, this is compiled as a single recursive definition.
ko: 후드 아래에서 이것은 단일 재귀적 정의로 컴파일된다.

source: Unicode
ko: 유니코드(Unicode)

source: Unlike section, namespaces require a name.
ko: section과는 달리, 이름공간은 이름이 필요합니다.

source: Unsurprisingly, it produces exactly the same proof term.
ko: 놀랄 것 없이, 이것은 정확히 동일한 증명항을 만듭니다.

source: Use tactic combinators to obtain a one line proof of the following:
ko: 다음의 한 줄 증명을 얻도록 전략조합자를 사용하세요.

source: Users can disable the implicit lambda feature by using @ or writing a lambda expression with {} or [] binder annotations.
ko: 사용자는 @을 사용하거나 {} 이나 []의 결합 주석으로 람다 표현식을 쓰는 것으로 암시적인 람다 기능을 해제할 수 있습니다.

source: Users may also wish to make use of additional libraries, or develop their own projects across multiple files.
ko: 사용자는 아마 추가적인 라이브러리의 사용 혹은 다수의 파일에 걸쳐 자신만의 프로젝트를 개발하기를 원할지도 모릅니다.

source: Using a tactic proof, we can be even more concise:
ko: 심지어 전략 증명을 사용하면 더 간결하게 됩니다.

source: Using inaccessible patterns, we can prompt the equation compiler to avoid the case split on n
ko: 접근 불가한 패턴을 사용하여 우리는 방정식 컴파일러가 n에 대해 경우를 나누는 것을 즉시 막도록 할 수 있습니다.

source: Using the Library
ko: 라이브러리 사용하기

source: Using the Simplifier
ko: 단순화기를 사용하기

source: Using the auxiliary function simpConst, define a function "fuse": to simplify a plus or a times, first simplify the arguments recursively, and then apply simpConst to try to simplify the result.
ko: 보조 함수 simpConst를 사용하여 함수 "fuse"를 정의하세요. 더하기와 곱하기를 간단히 하기 위해서 인수를 재귀적으로 단순화하세요. 그 뒤 simpConst을 결과를 단순화하는데 적용하세요.

source: Using the recursor or match with h₁ : a = b, we may assume a and b are the same, in which case, p b and p a are the same.
ko: 재귀자나 match를 h₁ : a = b과 사용하면, 우리는 a와 b가 같다고 가정할 수 있습니다. 그 경우 p b와 p a는 동일합니다.

source: Using the various gadgets described in this chapter --- the match statement, anonymous constructors, and the rewrite tactic, we can write this proof concisely as follows:
ko: 여기서 설명한 다양한 도구-match 구문, 익명 생성자, 다시쓰기전략-를 사용하여 다음과 같이 이 증명을 간결하게 쓸 수 있습니다.

source: Using these new features, you can write the other vector functions defined in the previous sections more compactly as follows:
ko: 이 새로운 기능을 사용하면 여러분은 이전에 정의한 다른 벡터 함수들을 다음과 같이 더 간결하게 쓸 수 있습니다.

source: Values of type Point are created using Point.mk a b, and the fields of a point p are accessed using Point.x p and Point.y p (but p.x and p.y also work, see below).
ko: Point형의 값은Point.mk a b를 사용하여 만들어집니다. 그리고 포인트 p의 필드는 Point.x p와 Point.y p를 사용해서 접근할 수 있습니다. (그러나 g6>p.x and p.y도 동작함, 아래를 참고)

source: Variables and Sections
ko: 변수와 섹션(Variables and Sections)

source: Variables are only included in declarations where they are actually used.
ko: 변수는 오직 그들이 실제로 사용되는 선언에만 포함됩니다.

source: Variables can also be specified as implicit when they are declared with the variable command:
ko: variable 명령으로 선언될 때 변수도 암시적으로 구체화될 수 있습니다.

source: We can make this more precise by looking at the commands the above unfold to:
ko: 우리는 위의 명령을 다음으로 펼쳐보는 것으로 이를 더 정확하게 만들 수 있습니다.

source: We also encourage you to show that Bool and Nat are inhabited, that the product of two inhabited types is inhabited, and that the type of functions to an inhabited type is inhabited.
ko: 또 우리는 여러분이 Bool과 Nat이 내장되었음을 보이길 권장합니다. 즉, 두 내장된 유형의 곱과 내장된 유형으로의 함수의 유형이 내장되었음을 보이길 원합니다.

source: We also leave it to you to determine which are nonconstructive, and hence require some form of classical reasoning.
ko: 우리는 또한 어떤 것이 비직관주의적인지 결정하는 것을 여러분에게 맡깁니다. 그러므로 일부는 고전 논리의 형식를 요구합니다.

source: We are then allowed to use the shorter name when we open the namespace.
ko: 그럼 우리는 우리가 이름공간을 열었을 때 더 짧은 이름을 사용할 수 있게 됩니다.

source: We are almost done describing the full range of inductive definitions accepted by Lean.
ko: 우리는 거의 린이 허용하는 귀납 정의의 대부분을 설명했습니다.

source: We are currently using a fork of it for the following additional features:
ko: 우리는 현재 다음 부가 기능을 위해 fork를 사용합니다.

source: We are grateful to Ulrik Buchholz, Kevin Buzzard, Mario Carneiro, Nathan Carter, Eduardo Cavazos, Amine Chaieb, Joe Corneli, William DeMeo, Marcus Klaas de Vries, Ben Dyer, Gabriel Ebner, Anthony Hart, Simon Hudon, Sean Leather, Assia Mahboubi, Gihan Marasingha, Patrick Massot, Christopher John Mazey, Sebastian Ullrich, Floris van Doorn, Daniel Velleman, Théo Zimmerman, Paul Chisholm, and Chris Lovett for their contributions.
ko: 우리는 Ulrik Buchholz, Kevin Buzzard, Mario Carneiro, Nathan Carter, Eduardo Cavazos, Amine Chaieb, Joe Corneli, William DeMeo, Marcus Klaas de Vries, Ben Dyer, Gabriel Ebner, Anthony Hart, Simon Hudon, Sean Leather, Assia Mahboubi, Gihan Marasingha, Patrick Massot, Christopher John Mazey, Sebastian Ullrich, Floris van Doorn, Daniel Velleman, Théo Zimmerman, Paul Chisholm, and Chris Lovett에게 그들의 공헌에 대해 감사드립니다.

source: We are still exploring this feature and analyzing its impact, but the experience so far has been very positive.
ko: 우리는 여전히 이 기능을 탐색하고 있고, 그것의 영향을 분석합니다. 그러나 지금까지의 경험은 아주 긍정적입니다.

source: We can then go on to define familiar notation in that namespace.
ko: 그럼 그 이름공간에 친숙한 기호를 정의해 나갈 수 있습니다.

source: We can then read t : p as the assertion that t is a proof of p.
ko: 우리는t : p를 t는 p의 증명이라는 주장으로써 읽을 수 있습니다.

source: We can view such inaccessible patterns as "don't care" components of the patterns.
ko: 우리는 그런 접속불가한 패턴을 패턴의 "신경쓰지 않는" 성분의 관점으로 볼 수 있습니다.

source: We can extend existing structures by adding new fields.
ko: 우리는 새 필드를 추가하여 존재하는 구조체를확장할 수 있습니다.

source: We can achieve exactly that using default instances.
ko: 우리는 정확히 이를 default instances으로 달성할 수 있습니다.

source: We can also think of such a type as a "record" or a "structure".
ko: 우리는 그런 유형으로써 "레코드" 혹은 "구조체"를 생각해볼 수도 있습니다.

source: We can also ask Lean to fill in the proof by writing ‹p›, where p is the proposition whose proof we want Lean to find in the context.
ko: 또 우린 린에게 ‹p›라고 써서 증명 속을 채우도록 린에게 요청할수 있습니다. 여기서 p는 명제이고, 그것의 증명은 현재 상황에서 린이 찾기 바라는 것입니다.

source: We can also separate constructors using a comma instead of |.
ko: 또 우리는 | 대신 콤마를 사용해 생성자를 나눌 수 있습니다.

source: We can also use the projection notation:
ko: 또 우리는 투영 기호(인덱싱 기호)를 사용할 수 있습니다.

source: We can also use the type Option α to simulate incomplete patterns.
ko: 우리는 불완전한 패턴을 모사하려고 Option α형을 사용할 수도 있습니다.

source: We can also use this device in function definitions:
ko: 우리는 함수 정의에서도 이 기능을 쓸 수 있습니다.

source: We can annotate the types used in the match for greater clarity:
ko: 우리는 더 명확함을 위해 match에서 사용되는 유형을 나타낼 수 있습니다.

source: We can declare one explicitly:
ko: 여러분은 명시적으로 이를 선언할 수 있습니다.

source: We can define functions from Weekday to Weekday:
ko: 우리는 Weekday에서 Weekday까지 함수를 정의할 수 있습니다.

source: We can even use the match statement to decompose the conjunction at the same time:
ko: 심지어 우리는 match 문장을 분해하는 동시에 결합하기 위해 사용할 수 있습니다.

source: We can make the output easier to read by telling Lean not to insert the implicit arguments (which are displayed here as metavariables).
ko: 우리는 린에게 암시적인 인자를 삽입하지 말라 함으로써 출력을 더 쉽게 읽어들이도록 만들 수 있습니다.(메타변수로서 나타난 인자입니다.)

source: We can now prove p ∧ q → q ∧ p with the following proof term.
ko: 이제 우리는 p ∧ q → q ∧ p를 따르는 증명 항으로 증명할 수 있습니다.

source: We can now use this theorem to prove new results:
ko: 우리는 이 정리로 새로운 결과를 증명하는데 쓸 수 있습니다.

source: We can prevent the shorter alias from being created by using the protected keyword:
ko: 우리느 더 짤은 별명이 생기는 것을 protected 키워드를 사용하여 막을 수 있습니다.

source: We can read this as the assertion "for every pair of propositions p q, we have p → q → p." For example, we can move all parameters to the right of the colon:
ko: 우리는 이를 "모든 명제쌍 p q에 대해 p → q → p이다."라고 주장한다고 읽을 수 있다. 예를 들어, 우리는 모든 매개변수들을 콜론의 오른쪽으로 옮길 수 있다.

source: We can refer to the last expression introduced in this way using the keyword this:
ko: 이렇게 도입된 마지막 표현식을 키워드 this를 사용하여 참조할 수 있습니다.

source: We can simulate the arbitrary value approach using the Inhabited type class.
ko: 우리는 Inhabited 유형 클래스를 사용하여 임의값 접근법을 모사할 수 있습니다.

source: We can then define any function f with an "inverse" which takes anything in the image of f to an element that is mapped to it.
ko: 그런 다음 f의 이미지에서 매핑된 요소로 가져오는 "역"함수가 있는 임의의 함수 f를 정의할 수 있습니다.

source: We can then use a mutual recursive definition to count the number of constants occurring in a term, as well as the number occurring in a list of terms.
ko: 그럼 우리는 상호적으로 재귀적인 정의를 항의 리스트에서 나타나는 수 뿐만 아니라 항 속의 상수의 수를 세는데 사용할 수 있습니다.

source: We can therefore rewrite the sample proof above conveniently as follows:
ko: 우리는 다음과 같이 위의 예시 증명을 간단히 줄여 쓸 수 있습니다.

source: We can use an element h : Eq a b to cast an element t' : p a to p b even when p a and p b are arbitrary types, because the cast does not produce new data; it only reinterprets the data we already have.
ko: 우리는 원소 h : Eq a b를 심지어 p a과 p b가 임의의 유형일 때에도 원소 t' : p a에서 p b로 변환하는데 사용할 수 있습니다. 왜냐하면 변환은 새로운 데이터를 만들지 않고 이미 가진 데이터를 재해석하기만 하기 때문입니다.

source: We can use the anonymous constructor notation ⟨t, h⟩ for Exists.intro t h, when the type is clear from the context.
ko: 우리는 맥락으로부터 형이 명백한 경우 익명 생성자 기호 ⟨t, h⟩을 Exists.intro t h에 대해 사용할 수 있습니다.

source: We can use the anonymous constructor notation to construct a proof of p ↔ q from proofs of the forward and backward directions, and we can also use . notation with mp and mpr.
ko: 우리는 앞과 뒷방향 증명으로부터 p ↔ q의 증명을 구성하기 위해 익명 생성자 표기를 사용할 수 있습니다. 그리고 우리는 .와 mp과 mpr을 사용한 표기를 쓸 수 있습니다.

source: We can use this to define the two projections for Prod.
ko: 우리는 이것을 Prod에 대한 두 투영(projection)이라고 정의하는데 사용할 수있습니다.

source: We can view Exists.intro as an information-hiding operation, since it hides the witness to the body of the assertion.
ko: 주장의 몸체의 발견을 감추기 때문에 우리는 Exists.intro을 정보 감추기 연산으로 볼 수 있습니다.

source: We close this section with one last tactic that is designed to facilitate working with inductive types, namely, the injection tactic.
ko: 귀납형과 동작하는 걸 가능하도록 설계된 즉, injection 전략으로 우리는 이 장을 이 마지막을 마칩니다.

source: We could implement double by
ko: 우리는 double을 아래와 같이 구현할 수 있습니다.

source: We could render this as follows:
ko: 이를 다음과 같이 얻을 수 있습니다.

source: We could represent this as follows:
ko: 이를 다음과 같이 나타낼 수 있습니다.

source: We could then introduce, for each element p : Prop, another type Proof p, for the type of proofs of p.
ko: 그러면 우리는 각각의 원소 p : Prop와 또 다른 유형인 Proof p을 p의 증명 유형으로 가져올 수 있습니다.

source: We describe some of them here.
ko: 여기서 우리는 이들 중 몇 가지를 설명합니다.

source: We encourage you to try it, using recOn, casesOn and noConfusion.
ko: 우리는 여러분이 이를 recOn, casesOn과 noConfusion을 사용해 시도해보길 권합니다.

source: We first observe that it would be easy to implement an ad-hoc polymorphic function (such as addition) if the function simply took the type-specific implementation of addition as an argument and then called that implementation on the remaining arguments.
ko: 우리는 먼저 함수가 단순히 덧셈의 특정 유형에 대한 구현을 덧셈의 인수로 취한 다음 나머지 인수에 대해 그 구현을 호출하면 임시 다형적 함수(덧셈 같은)를 구현하는 것이 쉽다는 것을 관찰했습니다.

source: We have chosen a nontraditional name here only to avoid a clash of names.
ko: 우리는 여기서 이름의 충돌을 방지하기 위해 비관습적인 이름을 선택할 뿐이었습니다.

source: We have already discussed the dependent product type Sigma:
ko: 우리는 이미 의존 곱 유형 Sigma에 대해 얘기했습니다.

source: We have already seen singleton elimination at play in applications of Eq.rec, the eliminator for the inductively defined equality type.
ko: 우리는 재귀적으로 정의된 동등 유형에 대한 제거자인Eq.rec의 활용에서 한번에 하나씩 제거되는 것을 보았습니다.

source: We have been using constructors to create elements of a structure type.
ko: 우리는 구조체 형의 원소를 생성하는데 생성자를 사용했습니다.

source: We have described inductive types and their syntax through examples.
ko: 우리는 귀납형과 그들의 문법을 예제를 통해 설명했습니다.

source: We have seen that Lean's formal foundation includes basic types, Prop, Type 0, Type 1, Type 2, ..., and allows for the formation of dependent function types, (x : α) → β.
ko: 우리는 린의 형식적인 기초가 기본형 Prop, Type 0, Type 1, Type 2, ...을 포합하고 의존 함수형 (x : α) → β의 형성을 가능하게 함을 보았습니다.

source: We have seen that Lean's foundational system includes inductive types.
ko: 우리는 귀납형을 포함해 린의 기초적인 체계를 보았습니다.

source: We have seen that keywords like fun, have, and show make it possible to write formal proof terms that mirror the structure of informal mathematical proofs.
ko: 우리는 fun과 have,show와 같은 키워드가 비형식적인 수학적 증명의 구조를 반영하는 형식적 증명 용어를 쓸 수 있게 만든 것을 보았습니다.

source: We have seen that the casesOn recursor can be used to define functions and prove theorems by cases, according to the constructors involved in an inductively defined type.
ko: 재귀적으로 정의된 유형에 연관된 생성자를 따라 우리는 casesOn 재귀자가 함수를 정의하고 경우를 나눠 정리를 증명하는데 사용될 수 있음을 보았습니다.

source: We have seen that the constructor to an inductive type takes parameters --- intuitively, the arguments that remain fixed throughout the inductive construction --- and indices, the arguments parameterizing the family of types that is simultaneously under construction.
ko: 우리는 귀납형에서 생성자는 매개변수(parameters)-- 직관적으로 재귀 생성 동안 고정된 상태로 남는 인수 --와 동시에 생성중인 유형의 군을 매개변수화하는 인수 indices를 받는 것을 보았습니다.

source: We have to provide the equation compiler with evidence that the recursive call is decreasing, which we do here with a sorry.
ko: 우리는 방정식 컴파일러에게 재귀호출이 감소한다는 증거를 주어야 합니다. 여기서 우리는 sorry로 했습니다.

source: We have used . to create nested tactic blocks.
ko: 우리는 중첩된 전략 블럭을 만드는데 .를 사용해왔습니다.

source: We have, moreover, noted that it is a remarkable fact that it is possible to construct a substantial edifice of mathematics based on nothing more than the type universes, dependent arrow types, and inductive types; everything else follows from those.
ko: 게다가 우리는 유형 세계, 의존 화살표 유형, 귀납형과 이들로부터 따라나온 모든 것 외에는 기반하지 않는 수학의 엄청난 구조물을 세울 수 있는 가능성을 발견한 사실은 주목할만 합니다.

source: We need to use the fact that the inductive type is generated by these constructors to know that the zero is not odd, and that the latter two implications reverse.
ko: 우리는 귀납형이 0은 홀수가 아니다는 것, 그리고 후자는 두 함의의 역이라는 것이 생성자들에 의해 만들어졌다는 사실을 이용할 필요가 있습니다.

source: We now consider two generalizations of inductive types that are often useful, which Lean supports by "compiling" them down to the more primitive kinds of inductive types described above.
ko: 이제 우리는 귀납형의 종종 유용한 두 가지 일반화를 고려했습니다. 린은 이들을 위에서 설명한 유도형의 더 기초적인 종류로 "컴파일"해나감으로써 지원합니다.

source: We often need an arbitrary element of a given type.
ko: 우린 종종 주어진 유형의 임의의 원소를 필요로 합니다.

source: We often put the by keyword on the preceding line, and write the example above as
ko: 우리는 종종 by 키워드를 앞줄에 놓고 위의 예를 다음과 같이 작성합니다.

source: We recommend running the examples and experimenting with the code on your own as you work through the chapters that follow.
ko: 우리는 여러분이 장을 따라 공부하면서 스스로 예제를 실행해보고 코드를 실험해보는 것을 추천합니다.

source: We recommend skimming this section to get a sense of Lean's features, and then returning to it as necessary.
ko: 우리는 린의 특징에 대한 감을 얻도록 건너뛰고 읽어보는 것을 추천합니다. 그리고 필요하다면 다시 여기로 돌아오세요.

source: We recommend you only use this command to diagnose problems.
ko: 우리는 이 명령을 여러분이 문제를 진단하는 데에만 사용하는 것을 권장합니다.

source: We saw in Namespaces that Lean provides mechanisms for working with hierarchical names.
ko: 우리는 Namespaces에서 린이 계층적인 이름으로 작업하는 메커니즘을 제공하는 것을 보았습니다.

source: We say it is "focusing" on the selected goal.
ko: 우리는 이를 선택한 목표에 "초점을 맞췄다"고 합니다.

source: We say the numerals 2 occurring in the elaborated terms are raw natural numbers.
ko: 동화된 항에서 나타나는 수치값 2가 생 자연수라고 말합니다.

source: We start with zero : Nat; it takes no arguments, so we have it from the start.
ko: zero : Nat으로 시작합니다. 이것은 아무 인수를 받지 않습니다. 그래서 우리는 시작부터 이것을 갖습니다.

source: We will also consider slight generalizations of the scheme above, to mutually defined inductive types, and so-called inductive families.
ko: 우리는 귀납형과 일명 귀납군을 동시에 정의하도록 위의 계획의 약간의 일반화를 고려할 것입니다.

source: We will describe proofs that consist of sequences of tactics as "tactic-style" proofs, to contrast with the ways of writing proof terms we have seen so far, which we will call "term-style" proofs.
ko: 우리는 전략의 연쇄로 이뤄진 증명을 "전략 스타일" 증명으로 설명할 것이고, 우리가 "항 스타일" 증명이라고 부를 것이고 이제까지 보았던 증명 항를 작성하는 방법과 대조할 것입니다.

source: We will discuss variations of rw and simp in the next chapter.
ko: 다음 장에서 rw와 simp의 변형을 다룰 것입니다.

source: We will explain how the instance command works in Chapter Type Classes.
ko: 유형 클래스 장에서 instance 명령이 어떻게 동작하는지 설명할 것입니다.

source: We will fill this gap in the next chapter, which introduces the notion of an inductive data type.
ko: 우리는 다음 장에서 inductive data type의 개념을 도입하여 이 간극을 메울 것입니다.

source: We will learn about writing such macros below.
ko: 우리는 아래에서 그런 매크로를 쓰는 법에 대해 배울 예정입니다.

source: We will learn more about the assumption tactic in the next chapter.
ko: 다음 장에서 assumption 전략에 대해 더 배울 예정입니다.

source: We will provide a number of examples of inductive types.
ko: 우리는 다수의 귀납형의 예제를 제공합니다.

source: We will see below that the arguments of the constructors can include objects of type Foo, subject to a certain "positivity" constraint, which guarantees that elements of Foo are built from the bottom up.
ko: 우리는 아래에서 생성자의 인자가 Foo 형의 대상을 특정 Foo의 원소가 상향식으로 만들어졌음을 보장하는 "긍정성" 제약을 조건으로 하여 포함할 수 있음을 볼 것입니다.

source: We will see in Chapter Induction and Recursion that all these variations are instances of a more general pattern-matching construct.
ko: 유도와 재귀에서 더 일반적인 패턴-매칭 생성 개체들의 모든 변형을 볼 겁니다.

source: We will see in Chapter Structures and Records that certain types in Lean are structures, which is to say, the type is defined with a single canonical constructor which builds an element of the type from a sequence of suitable arguments.
ko: 구조체와 레코드 장에서 보겠지만 린의 어떤 유형은 구조체입니다. 그 말은 유형이 하나의 적절한 인수의 배열로부터 유형의 원소를 만드는 정식 생성자로 정의된다는 것입니다.

source: We will see in Chapter Inductive Types and Chapter Structures and Records that defining structures and inductive data types in Lean generates associated operations, and these are stored in a namespace with the same name as the type under definition.
ko: 우리는 Chapter Inductive Types와 Chapter Structures and Records에서 린에서 구조체와 유도 데이터 형을 정의하는 것은 연관된 연산을 생성함을 볼 예정입니다. 그리고 이들은 정의에 대해 유형으로써 같은 이름으로 이름공간에 저장됩니다.

source: We will see later that there are situations in constructive logic where principles like excluded middle and double-negation elimination are permissible, and Lean supports the use of classical reasoning in such contexts without relying on excluded middle.
ko: 우리는 나중에 배중률과 이중 부정 제거와 같은 원칙이 허용되는 직관주의적 논리 상황이 있음을 나중에 보게 될 것입니다. 그리고 린은 그런 맥락에서 배중률에 의존하지 않는 고전논리의 사용을 지원합니다.

source: We will see more examples in Chapter Structures and Records.
ko: 우리는 구조체와 레코드 장에서 더 많은 예제를 볼 것입니다.

source: We will start with some basic examples of inductive types, and work our way up to more elaborate and complex examples.
ko: 우리는 귀납형의 몇 가지 기본적인 예제로 시작할 것입니다. 그리고 우리의 작업을 더 정교하고 복잡한 예제로 옮겨갈 것입니다.

source: We will use the match expression to define a function from Weekday to the natural numbers:
ko: 우리는 Weekday로부터 자연수로의 함수를 정의하는데 match 표현식을 사용합니다.

source: Well-Founded Recursion and Induction
ko: 잘 세워진 재귀와 귀납

source: What characterizes the examples we consider in this section is that this is not the case: each constructor relies only on previously specified types.
ko: 예제를 특징짓는 것은 이 섹션에서 우리는 이 경우만이 아니라 각 생성자가 이전에 명시된 유형에만 의존한다는 점입니다.

source: What follows are some common identities involving the existential quantifier.
ko: 다음은 존재 한정기호를 포함한 몇 가지 흔한 항등식들 입니다.

source: What follows is an example of an identity from propositional logic that we proved in a previous chapter, now proved using tactics.
ko: 다음의 것은 전략을 사용해 증명할 이전 장에서 증명한 명제논리의 항등식의 예시들입니다.

source: What makes dependent type theory dependent?
ko: 무엇이 의존 유형론을 의존적이게 만드는가?

source: What makes recursion and induction possible is that they can also involve recursive calls to foo.
ko: 재귀와 귀납을 가능하게 만드는 것은 이들이 foo에 대한 재귀적인 호출을 포함할 수 있다는 점 입니다.

source: What makes simple type theory powerful is that you can build new types out of others.
ko: 단순 유형론을 강력하게 만드는 것은 기본형 외의 여러분만의 새로운 유형을 만들 수 있다는 점입니다.

source: What makes the equation compiler powerful is that it also supports recursive definitions.
ko: 방정식 컴파일러를 강력하게 만드는 것은 재귀적인 정의를 지원한다는 점입니다.
